### Konversi Nilai Numerik

In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.2.4
1.20.1

### Persiapan DataFrame

In [2]:
n_rows=10
n_cols=1
cols=('usia',)
df=pd.DataFrame(np.random.randint(1,99,size=(n_rows,n_cols)),columns=cols)

df

   usia
0    88
1    31
2    47
3    41
4    37
5    53
6    36
7     4
8    87
9    47

### Pengelompokan Nilai numerik dalam beberapa kategori dengan CUT()

In [3]:
df['kelompok_usia']=pd.cut(df['usia'],bins =[0,18,65,99],labels=['anak','dewasa','manusia'])

df

   usia kelompok_usia
0    88       manusia
1    31        dewasa
2    47        dewasa
3    41        dewasa
4    37        dewasa
5    53        dewasa
6    36        dewasa
7     4          anak
8    87       manusia
9    47        dewasa